Repository: zubrlc/amneziawg-apple
Catalog: Sources/WireGuardApp/Localizable.xcstrings
Source language: en
Languages: de, es, fa, fi, fr, it, ja, pa, pl, ro, ru, sl, tr, zh_hans

# actionCancel
source: Cancel
de: Abbrechen
es: Cancelar
fa: لغو
fi: Peruuta
fr: Annuler
it: Annulla
ja: キャンセル
pa: ਰੱਦ ਕਰੋ
pl: Anuluj
ro: Anulare
ru: Отмена
sl: Prekliči
tr: İptal
zh_hans: 取消

# actionSave
source: Save
de: Speichern
es: Guardar
fa: ذخیره
fi: Tallenna
fr: Enregistrer
it: Salva
ja: 保存
pa: ਸੰਭਾਲੋ
pl: Zapisz
ro: Salvare
ru: Сохранить
sl: Shrani
tr: Kaydet
zh_hans: 保存

# addPeerButtonTitle
source: Add peer
de: Peer hinzufügen
es: Añadir par
fa: افزودن همتا
fi: Lisää toinen osapuoli
fr: Ajouter un pair
it: Aggiungi peer
ja: ピアを追加
pa: ਪੀਅਰ ਜੋੜੋ
pl: Dodaj Peer'a
ro: Adăugare pereche
ru: Добавить пира
sl: Dodaj vrstnika
tr: Eş ekle
zh_hans: 添加节点

# addTunnelMenuFromScratch
source: Create from scratch
de: Selbst erstellen
es: Crear desde cero
fa: ساختن از طریق خراش دادن
fi: Luo alusta
fr: Créer à partir de rien
it: Crea da zero
ja: 空の状態から作成
pa: ਮੁੱਢ ਤੋਂ ਬਣਾਓ
pl: Utwórz od podstaw
ro: Creare de la zero
ru: Создать с нуля
sl: Ustvari na novo
tr: Sıfırdan oluştur
zh_hans: 手动创建

# addTunnelMenuHeader
source: Add a new AmneziaWG tunnel
de: AmneziaWG-Tunnel hinzufügen
es: Añadir un nuevo túnel AmneziaWG
fa: اضافه کردن تونل جدید وایرگارد
fi: Lisää uusi AmneziaWG tunneli
fr: Ajouter un nouveau tunnel AmneziaWG
it: Aggiungi un nuovo tunnel AmneziaWG
ja: AmneziaWGトンネルの追加
pa: ਨਵੀਂ AmneziaWG ਟਨਲ ਬਣਾਓ
pl: Dodaj nowy tunel AmneziaWG
ro: Adaugă un nou tunel AmneziaWG
ru: Добавить новый туннель AmneziaWG
sl: Dodaj nov tunel AmneziaWG
tr: Yeni bir AmneziaWG tüneli ekle
zh_hans: 新建 AmneziaWG 隧道

# addTunnelMenuImportFile
source: Create from file or archive
de: Aus Datei oder Archiv erstellen
es: Crear desde archivo
fa: ساختن از طریق پرونده یا آرشیو
fi: Luo tiedostosta tai arkistosta
fr: Créer depuis un fichier ou une archive
it: Crea da file o archivio
ja: ファイル、アーカイブから作成
pa: ਫ਼ਾਇਲ ਜਾਂ ਅਕਾਇਵ ਤੋਂ ਬਣਾਓ
pl: Utwórz z pliku lub archiwum
ro: Creare din fișier sau arhivă
ru: Создать из файла или архива
sl: Uvozi iz datoteke ali arhiva
tr: Dosya veya arşivden ekle
zh_hans: 导入配置或压缩包

# addTunnelMenuQRCode
source: Create from QR code
de: Aus QR-Code erstellen
es: Crear desde código QR
fa: ساختن از طریق QR کد
fi: Luo QR-koodista
fr: Créer à partir d'un code QR
it: Crea da codice QR
ja: QRコードから作成
pa: QR ਕੋਡ ਤੋਂ ਬਣਾਓ
pl: Utwórz za pomocą kodu QR
ro: Creare din cod QR
ru: Создать из QR-кода
sl: Skeniraj kodo QR
tr: QR kodundan ekle
zh_hans: 扫描二维码

# alertBadArchiveMessage
source: Bad or corrupt zip archive.
de: Fehlerhaftes oder beschädigtes Zip-Archiv.
es: Archivo zip erróneo o corrupto.
fa: آرشیو زیپ، بد یا خراب است.
fi: Huono tai korruptoitunut zip arkisto.
fr: Archive zip incorrecte ou corrompue.
it: Archivio zip non valido o danneggiato.
ja: 不良なZIPアーカイブファイルです
pa: ਖ਼ਰਾਬ ਜਾਂ ਨਿਕਾਰਾ ਜ਼ਿੱਪ ਅਕਾਇਵ ਹੈ।
pl: Niewłaściwe lub uszkodzone archiwum ZIP.
ro: Arhivă zip incorectă sau deteriorată.
ru: Некорректный или поврежденный zip-архив.
sl: Pokvarjen arhiv zip.
tr: Kötü veya bozuk zip arşivi.
zh_hans: 压缩包无效或损坏。

# alertBadArchiveTitle
source: Unable to read zip archive
de: Zip-Archiv kann nicht gelesen werden
es: No se pudo leer el archivo zip
fa: نمی‌توان آرشیو زیپ را خواند
fr: Impossible de lire l'archive zip
it: Impossibile leggere l'archivio zip
ja: ZIPアーカイブの読込不可
pa: ਜ਼ਿੱਪ ਅਕਾਇਵ ਪੜ੍ਹਨ ਲਈ ਅਸਮਰੱਥ
pl: Nie można odczytać archiwum ZIP
ro: Arhiva zip nu poate fi citită
ru: Невозможно прочитать zip-архив
sl: Arhiva zip ni bilo mogoče prebrati
tr: Zip arşivi okunamıyor
zh_hans: 无法读取压缩包

# alertBadConfigImportMessage (%@)
source: The file ‘%@’ does not contain a valid AmneziaWG configuration
de: Die Datei ‘%@’ enthält keine gültige AmneziaWG-Konfiguration
es: El archivo ‘%@’ no contiene una configuración válida de AmneziaWG
fi: Tiedosto ”%@” ei sisällä kelvollista AmneziaWG konfiguraatiota
fr: Le fichier ‘%@’ contient une de configuration AmneziaWG invalide
it: Il file “%@” non contiene una configurazione di AmneziaWG valida
ja: ファイル ‘%@’ には有効な AmneziaWG の設定がありません
pa: ਫ਼ਾਇਲ ‘%@’ ਵਿੱਚ ਵਾਜਬ AmneziaWG ਸੰਰਚਨਾ ਨਹੀਂ ਰੱਖਦੀ ਹੈ
pl: Plik „%@” nie zawiera prawidłowej konfiguracji AmneziaWG
ro: Fișierul „%@” nu conține o configurație AmneziaWG validă
ru: Файл ‘%@’ не содержит корректной конфигурации AmneziaWG
sl: Datoteka "%@" ne vsebuje veljavne konfiguracije AmneziaWG
tr: ‘%@’ dosyası geçerli bir AmneziaWG konfigürasyonu içermiyor
zh_hans: 在文件 ‘%@’ 中未发现有效的 AmneziaWG 配置

# alertBadConfigImportTitle
source: Unable to import tunnel
de: Tunnel konnte nicht importiert werden
es: No se puede importar túnel
fa: نمی‌توان تونل را وارد کرد
fi: Tunnelia ei voitu tuoda
fr: Impossible d'importer le tunnel
it: Impossibile importare il tunnel
ja: トンネルをインポートできません
pa: ਟਨਲ ਇੰਪੋਰਟ ਕਰਨ ਲਈ ਅਸਮਰੱਥ
pl: Nie można zaimportować tunelu
ro: Tunelul nu poate fi importat
ru: Не удалось импортировать туннель
sl: Tunela ni mogoče uvoziti
tr: Tünel içeri aktarılamıyor
zh_hans: 无法导入隧道

# alertCantOpenInputConfFileMessage (%@)
source: The file ‘%@’ could not be read.
de: Die Datei ‘%@’ konnte nicht gelesen werden.
fr: Le fichier ‘%@’ n’a pas pu être lu.
it: Il file ‘%@’ non può essere letto.
ja: ファイル ‘%@’ は読み込めません
pa: ਫ਼ਾਇਲ ‘%@’ ਪੜ੍ਹਿਆ ਨਹੀਂ ਜਾ ਸਕਿਆ।
pl: Nie można odczytać pliku „%@”.
ro: Fișierul „%@” nu a putut fi citit.
ru: Не удалось прочитать файл ’%@’.
sl: Datoteke "%@" ni bilo mogoče prebrati.
tr: ‘%@’ dosyası okunamadı.
zh_hans: 文件 “%@” 无法读取。

# alertCantOpenInputConfFileTitle
source: Unable to import from file
de: Import aus Datei nicht möglich
fr: Impossible d'importer depuis le fichier
it: Impossibile importare da file
ja: ファイルからのインポート不可
pa: ਫ਼ਾਇਲ ਤੋਂ ਦਰਾਮਦ ਕਰਨ ਲਈ ਅਸਮਰੱਥ
pl: Nie można zaimportować z pliku
ro: Nu se poate importa din fișier
ru: Невозможно импортировать из файла
sl: Uvoz iz datoteke ni uspel
tr: Dosyadan içe aktarılamıyor
zh_hans: 无法从文件中导入

# alertCantOpenInputZipFileMessage
source: The zip archive could not be read.
de: Das Zip-Archiv konnte nicht gelesen werden.
es: El archivo zip no pudo ser leído.
fr: L'archive zip n'a pas pu être lue.
it: L'archivio zip non può essere letto.
ja: ZIPアーカイブが読み込めません
pa: ਜ਼ਿੱਪ ਅਕਾਇਵ ਪੜ੍ਹਿਆ ਨਹੀਂ ਜਾ ਸਕਿਆ।
pl: Nie można odczytać archiwum zip.
ro: Arhiva zip nu a putut fi citită.
ru: Невозможно прочитать zip-архив.
sl: Arhiva zip ni bilo mogoče prebrati.
tr: Zip arşivi okunamadı.
zh_hans: 该压缩包无法读取。

# alertCantOpenInputZipFileTitle
source: Unable to read zip archive
de: Zip-Archiv kann nicht gelesen werden
es: No se pudo leer el archivo zip
fr: Impossible de lire l'archive zip
it: Impossibile leggere l'archivio zip
ja: ZIPアーカイブの読込不可
pa: ਜ਼ਿਪ ਅਕਾਇਵ ਪੜ੍ਹਨ ਲਈ ਅਸਮਰੱਥ ਹੈ
pl: Nie można odczytać archiwum zip
ro: Arhiva zip nu poate fi citită
ru: Невозможно прочитать zip-архив
sl: Arhiva zip ni bilo mogoče prebrati
tr: Zip arşivi okunamıyor
zh_hans: 无法读取压缩包

# alertCantOpenOutputZipFileForWritingMessage
source: Could not open zip file for writing.
de: Zip-Datei konnte nicht zum Schreiben geöffnet werden.
es: No se pudo abrir el archivo zip para escribir.
fr: Impossible d'ouvrir le fichier zip en écriture.
it: Impossibile aprire in file zip per la scrittura.
ja: ZIPファイルを書き込み用に開けません
pa: ਲਿਖਣ ਲਈ ਜ਼ਿੱਪ ਫ਼ਾਇਲ ਖੋਲ੍ਹੀ ਨਹੀਂ ਜਾ ਸਕੀ।
pl: Nie udało się otworzyć pliku ZIP do zapisu.
ro: Fișierul zip nu a putut fi deschis în vederea scrierii.
ru: Не удалось открыть zip-архив для записи.
sl: Ne morem odpreti arhiva zip za zapisovanje.
tr: Zip dosyası yazmak için açılamadı.
zh_hans: 无法打开zip文件以写入。

# alertCantOpenOutputZipFileForWritingTitle
source: Unable to create zip archive
de: Zip-Archiv kann nicht erstellt werden
es: No se pudo crear el archivo zip
fr: Impossible de créer l'archive zip
it: Impossibile creare l'archivio zip
ja: ZIPアーカイブ作成不可
pa: ਜ਼ਿੱਪ ਅਕਾਇਵ ਬਣਾਉਣ ਲਈ ਅਸਮਰੱਥ ਹੈ
pl: Nie można utworzyć archiwum ZIP
ro: Arhiva zip nu poate fi creată
ru: Невозможно создать zip-архив
sl: Arhiva zip ni bilo mogoče ustvariti
tr: Zip arşivi oluşturulamıyor
zh_hans: 无法创建压缩包

# alertImportedFromMultipleFilesMessage (%1$d of %2$d)
source: Created %1$d of %2$d tunnels from imported files
de: %1$d von %2$d Tunnel aus importierten Dateien erstellt
es: Creado %1$d de %2$d túneles desde archivos importados
fi: Luotu %1$d / %2$d tunnelia tuoduista tiedostoista
fr: %1$d des %2$d tunnels ont étés créés à partir des fichiers importés
it: Creati %1$d di %2$d tunnel da file importati
ja: インポートファイルの %2$d 件中の %1$d トンネルを作成しました
pa: ਇੰਪੋਰਟ ਕੀਤੀਆਂ ਫ਼ਾਇਲਾਂ ਤੋਂ %2$d ਟਨਲਾਂ ਵਿੱਚੋਂ %1$d ਬਣਾਈਆਂ
pl: Utworzono %1$d z %2$d tuneli z zaimportowanych plików
ro: S-au creat %1$d din %2$d tuneluri din fișiere importate
ru: Создано туннелей из импортированных файлов: %1$d из %2$d
sl: Ustvarjenih tunelov iz uvoženih datotek: %1$d od %2$d
tr: İçeri aktarılan dosyalardan %1$d/%2$d tünel oluşturuldu
zh_hans: 通过文件导入了 %2$d 项中的 %1$d 项

# alertImportedFromMultipleFilesTitle (%d)
source: Created %d tunnels
de: %d Tunnel erstellt
es: %d túneles creados
fa: تونل %d ساخته شد
fi: Luotu %d tunnelia
fr: %d tunnels ont été créés
it: Creati %d tunnel
ja: %d トンネルを作成しました
pa: %d ਟਨਲ ਬਣਾਈਆਂ
pl: Utworzono %d tuneli
ro: S-au creat %d tuneluri
ru: Создано туннелей: %d
sl: Ustvarjenih tunelov: %d
tr: %d tünel oluşturuldu
zh_hans: 导入了 %d 项

# alertImportedFromZipMessage (%1$d of %2$d)
source: Created %1$d of %2$d tunnels from zip archive
de: %1$d von %2$d Tunnel aus Zip-Archiv erstellt
es: Creado %1$d de %2$d túneles a partir del archivo zip
fi: Luotu %1$d / %2$d tunnelia zip-arkistosta
fr: %1$d des %2$d tunnels ont étés créés à partir de l'archive zip
it: Creati %1$d di %2$d tunnel da file importati
ja: ZIP アーカイブの %2$d 件中の %1$d トンネルを作成しました
pa: ਜ਼ਿੱਪ ਅਕਾਇਵ ਤੋਂ %2$d ਟਨਲਾਂ ਵਿੱਚੋਂ %1$d ਬਣਾਈਆਂ
pl: Utworzono %1$d z %2$d tuneli z archiwum zip
ro: S-au creat %1$d din %2$d tuneluri din arhiva zip
ru: Создано туннелей из zip-архива: %1$d из %2$d
sl: Ustvarjenih tunelov iz arhiva zip: %1$d od %2$d
tr: Zip arşivinden %1$d/%2$d tünel oluşturuldu
zh_hans: 通过压缩包导入了 %2$d 项中的 %1$d 项

# alertImportedFromZipTitle (%d)
source: Created %d tunnels
de: %d Tunnel erstellt
es: Creados %d túneles
fa: %d تونل ایجاد شد
fi: Luotu %d tunnelia
fr: %d tunnels ont été créés
it: Creati %d tunnel
ja: %d トンネルを作成しました
pa: %d ਟਨਲ ਬਣਾਈਆਂ
pl: Utworzono %d tuneli
ro: S-au creat %d tuneluri
ru: Создано туннелей: %d
sl: Ustvarjenih tunelov: %d
tr: %d tünel oluşturuldu
zh_hans: 导入了 %d 项

# alertInvalidInterfaceMessageAddressInvalid
source: Interface addresses must be a list of comma-separated IP addresses, optionally in CIDR notation
de: Schnittstellen-Adressen müssen eine Liste von kommaseparierten IP-Adressen sein, optional in CIDR-Notation
es: Las direcciones de la interfaz deben ser una lista de direcciones IP separadas por comas, opcionalmente en notaciòn CIDR
fi: Sovittimen osoitteet on oltava pilkulla erotettujen IP-osoitteiden luettelo, valinnaisesti CIDR-notaatiossa
fr: Les adresses d'interface doivent être une liste d'adresses IP séparées par des virgules, optionnellement en notation CIDR
it: Gli indirizzi dell'interfaccia devono essere una lista di indirizzi IP separati da virgole, facoltativamente nella notazione CIDR
ja: インターフェースのアドレスはカンマで区切られたIPアドレス（CIDR表記可）のリストでなければなりません
pa: ਇੰਟਰਫੇਸ ਐਡਰੈਸ ਕਾਮਿਆਂ ਰਾਹੀਂ ਵੱਖ ਕੀਤੇ ਹੋਏ IP ਐਡਰੈਸ, ਚੋਣਵੇਂ ਵਿੱਚ CIDR ਰੂਪ ਵਿੱਚ ਸੂਚੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Adresy interfejsu muszą być listą adresów IP rozdzielone przecinkami, opcjonalnie w notacji CIDR
ro: Adresele interfeței trebuie să reprezinte o listă cu adrese IP separate prin virgulă, opțional în notația CIDR
ru: IP-адреса интерфейса должны быть списком, разделенные запятыми, желательно с комментариями CIDR
sl: Omrežni naslovi vmesnikov morajo biti v seznamu ločeni z vejico, izbirno v zapisu CIDR
tr: Arayüz adresleri, isteğe bağlı olarak CIDR gösteriminde virgülle ayrılmış IP adreslerinin bir listesi olmalıdır
zh_hans: 接口地址必须是一个逗号分隔的 IP 地址列表, 可用 CIDR 表示

# alertInvalidInterfaceMessageDNSInvalid
source: Interface’s DNS servers must be a list of comma-separated IP addresses
de: Die DNS-Server der Schnittstelle müssen eine Liste von kommaseparierten IP-Adressen sein
es: Los servidores DNS de la interfaz deben ser una lista de direcciones IP separadas por comas
fi: Sovittimen DNS-palvelimien on oltava lista pilkulla erotettu IP-osoitteita
fr: Les serveurs DNS de l'interface doivent être une liste d'adresses IP séparées par des virgules
it: I server DNS dell'interfaccia devono essere una elenco di indirizzi IP separati da virgole
ja: インターフェースのDNSサーバはカンマで区切られたIPアドレスのリストでなければなりません
pa: ਇੰਟਰਫੇਸ ਦੇ DNS ਸਰਵਰ ਕਾਮਿਆਂ ਰਾਹੀਂ ਵੱਖ ਕੀਤੇ IP ਐਡਰੈਸ ਦੀ ਸੂਚੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Serwery DNS interfejsu muszą być listą adresów IP rozdzielonych przecinkami
ro: Serverele DNS ale interfeței trebuie să fie o listă de adrese IP separate prin virgulă
ru: DNS-серверы интерфейса должны быть списком, разделенные запятыми
sl: Strežniki DNS za vmesnik morajo biti v seznamu, kjer so naslovi IP ločeni z vejico
tr: Arayüzün DNS sunucuları, virgülle ayrılmış IP adreslerinin bir listesi olmalıdır
zh_hans: 接口的DNS服务器必须是逗号分隔的 IP 地址列表

# alertInvalidInterfaceMessageListenPortInvalid
source: Interface’s listen port must be between 0 and 65535, or unspecified
de: Der Schnittstellen-Listen-Port muss zwischen 0 und 65535 liegen oder nicht spezifiziert sein
es: El puerto de escucha de la interfaz debe estar entre 0 y 65535, o no especificado
fi: Sovittimen kuunteluportin on tulee olla väliltä 0 - 65535, tai sen on oltava määrittelemätön
fr: Le port d'écoute de l'interface doit être compris entre 0 et 65535, ou non spécifié
it: La porta di ascolto dell'interfaccia deve essere compresa tra 0 e 65535, o non specificata
ja: インターフェースの待受ポートは0から65535の範囲内の値か、または未指定でなければなりません
pa: ਇੰਟਰਪੇਸ ਦੀ ਸੁਣਨ ਪੋਰਟ 0 ਤੋਂ 65535 ਵਿੱਚ ਜਾਂ ਨਾ ਦਿੱਤੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Port nasłuchiwania interfejsu musi wynosić pomiędzy 0 a 65535 lub nieokreślony
ro: Portul de ascultare al interfeței trebuie să fie între 0 și 65535 sau să fie nespecificat
ru: Порт интерфейса должен быть от 0 до 65535, или не указан
sl: Vrata na katerih vmesnik posluša morajo biti med 0 in 65535 ali nedoločena
tr: Arayüzün dinleme bağlantı noktası 0 ile 65535 arasında veya belirtilmemiş olmalıdır
zh_hans: 接口的监听端口必须介于 0 至 65535 之间，或不指定

# alertInvalidInterfaceMessageMTUInvalid
source: Interface’s MTU must be between 576 and 65535, or unspecified
de: Die MTU der Schnittstelle muss zwischen 576 und 65535 oder nicht spezifiziert sein
es: La MTU de la interfaz debe estar entre 576 y 65535, o no especificada
fi: Sovittimen MTU on oltava väliltä 576 - 65535, tai sen on oltava määrittelemätön
fr: Le port d'écoute de l'interface doit être compris entre 576 et 65535, ou non spécifié
it: Il valore di MTU dell'interfaccia deve essere compreso tra 576 e 65535, o non specificato
ja: インターフェースのMTUは576から65535の範囲内の値か、または未指定でなければなりません
pa: ਇੰਟਰਫੇਸ ਦਾ MTU 576 ਤੋਂ 65535 ਦੇ ਵਿਚਾਲੇ ਜਾਂ ਨਾ ਦਿੱਤਾ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ
pl: Wartość MTU musi wynosić pomiędzy 576 a 65535 lub nieokreślona
ro: Valoarea MTU a interfeței trebuie să fie cuprinsă între 576 și 65535 sau să fie nespecificată
ru: MTU интерфейса должен быть между 576 и 65535, или не указан
sl: Največja transportna enota (MTU) vmesnika mora biti med 576 in 65535, ali nedoločena
tr: Arayüzün MTU’su 576 ile 65535 arasında veya belirtilmemiş olmalıdır
zh_hans: 接口的MTU必须介于 576 至 65535 之间，或不指定。

# alertInvalidInterfaceMessageNameRequired
source: Interface name is required
de: Name der Schnittstelle ist erforderlich
es: Se requiere nombre de interfaz
fa: نام رابط الزامی است
fi: Sovittimen nimi vaadittu
fr: Le nom de l'interface est requis
it: Il nome dell'interfaccia è richiesto
ja: インターフェース名は必須の設定項目です
pa: ਇੰਟਰਫੇਸ ਦਾ ਨਾਂ ਚਾਹੀਦਾ ਹੈ
pl: Nazwa interfejsu jest wymagana
ro: Este necesar numele interfeței
ru: Введите имя интерфейса
sl: Ime vmesnika je obvezno
tr: Arayüz ismi gerekli
zh_hans: 必须填写接口名称

# alertInvalidInterfaceMessagePrivateKeyInvalid
source: Interface’s private key must be a 32-byte key in base64 encoding
de: Der private Schlüssel der Schnittstelle muss ein 32-Byte-Schlüssel in der base64-Kodierung sein
es: La clave privada de interfaz debe ser una clave de 32 bytes en la codificación base64
fi: Sovittimen yksityinen avain on oltava 32-tavuinen avain base64 enkoodauksella
fr: La clef privée de l'interface doit être une clé de 32 octets dans l'encodage base64
it: La chiave privata dell'interfaccia deve essere una chiave a 32 byte con codifica base64
ja: インターフェースの秘密鍵はBase64でエンコードされた32バイトの長さでなければなりません
pa: ਇੰਟਰਫੇਸ ਦੀ ਪ੍ਰਾਈਵੇਟ ਕੁੰਜੀ base64 ਇੰਕੋਡਿੰਗ ਵਿੱਚ 32-ਬਾਈਟ ਕੁੰਜੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Klucz prywatny interfejsu musi być 32-bajtowym kluczem zakodowanym w base64
ro: Cheia privată a interfeței trebuie să fie o cheie de 32 de octeți în codificarea base64
ru: Приватный ключ интерфейса должен быть 32-байтным в кодировке base64
sl: Zasebni ključ vmesnika mora biti 32-bajtni ključ v zapisu Base64
tr: Arayüz’ün özel anahtarı base64 kodlamalı bir 32-byte anahtar olmalı
zh_hans: 接口的私钥必须是用base64编码的32字节密钥

# alertInvalidInterfaceMessagePrivateKeyRequired
source: Interface’s private key is required
de: Der private Interface-Schlüssel ist erforderlich
es: La clave privada de la interfaz es necesaria
fa: کلید خصوصی رابط الزامی است
fi: Sovittimen yksityinen avain on vaadittu
fr: La clef privée de l'interface est requise
it: La chiave privata dell'interfaccia è necessaria
ja: インターフェースの秘密鍵は必須の設定項目です
pa: ਇੰਟਰਫੇਸ ਦੀ ਪ੍ਰਾਈਵੇਟ ਕੁੰਜੀ ਚਾਹੀਦੀ ਹੈ
pl: Klucz prywatny interfejsu jest wymagany
ro: Este necesară cheia privată a interfeței
ru: Введите приватный ключ интерфейса
sl: Zasebni ključ vmesnika je obvezen
tr: Arayüz’ün özel anahtarı gerekli
zh_hans: 需要接口的私钥

# alertInvalidInterfaceTitle
source: Invalid interface
de: Ungültige Schnittstelle
es: Interfaz inválida
fa: رابط نامعتبر است
fi: Virheellinen liittymä
fr: Interface invalide
it: Interfaccia non valida
ja: 無効なインターフェース
pa: ਅਵੈਧ ਇੰਟਰਫੇਸ
pl: Niewłaściwy interfejs
ro: Interfață invalidă
ru: Недопустимый интерфейс
sl: Neveljaven vmesnik
tr: Geçersiz arayüz
zh_hans: 无效接口

# alertInvalidPeerMessageAllowedIPsInvalid
source: Peer’s allowed IPs must be a list of comma-separated IP addresses, optionally in CIDR notation
de: Erlaubte IPs des Teilnehmers müssen eine Liste kommaseparierter IP-Adressen sein, optional in CIDR-Notation
es: Las IPs permitidas del par deben ser una lista de direcciones IP separadas por comas, opcionalmente en notación CIDR
fi: Toisen osapuolen sallittujen IP-osoitteiden on oltava pilkulla erotettujen IP-osoitteiden luettelo, valinnaisesti CIDR-notaatiossa
fr: Les adresses IP autorisées par le pair doivent être une liste d'adresses IP séparées par des virgules, éventuellement dans la notation CIDR
it: Gli IP consentiti dal peer devono essere un elenco di indirizzi IP separati da virgole, facoltativamente nella notazione CIDR
ja: ピアのAllowed IPはカンマで区切られたIPアドレス（CIDR表記可）のリストでなければなりません
pa: ਪੀਅਰ ਦੇ ਮਨਜ਼ੂਰ ਕੀਤੇ IP ਕਾਮਿਆਂ ਰਾਹੀਂ ਵੱਖ ਕੀਤੇ ਹੋਏ IP ਐਡਰੈਸ, ਚੋਣਵੇਂ ਵਿੱਚ CIDR ਰੂਪ ਵਿੱਚ ਸੂਚੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Dozwolone adresy peer'a muszą być listą adresów IP rozdzielone przecinkami, opcjonalnie w notacji CIDR
ro: IP-urile permise ale perechii trebuie să reprezinte o listă cu adrese IP separate prin virgulă, opțional în notația CIDR
ru: Разрешенные IP-адреса пиров должны быть списком, разделенные запятыми, желательно с комментариями CIDR
sl: Omrežni naslovi vrstnika morajo biti v seznamu ločeni z vejico, izbirno v zapisu CIDR
tr: Eşlerin izin verilen IP’leri, isteğe bağlı olarak CIDR gösteriminde virgülle ayrılmış IP adreslerinin bir listesi olmalıdır
zh_hans: 节点的允许访问IP必须是一个逗号分隔的 IP 地址列表, 可用 CIDR 表示

# alertInvalidPeerMessageEndpointInvalid
source: Peer’s endpoint must be of the form ‘host:port’ or ‘[host]:port’
de: Der Endpunkt des Peers muss dem Format 'host:port' oder '[host]:port' entsprechen
es: El punto final del par debe ser de la forma ‘host:port’ o ‘[host]:port’
fi: Käyttäjän päätepisteen on oltava muotoa ”host:port” tai ”[host]:port”
fr: Le point de terminaison du pair doit être de la forme « host:port» ou «[host]:port»
it: L'endpoint del peer deve essere nella forma 'host:porta' o '[host]:porta'
ja: ピアのエンドポイントは 'ホスト:ポート番号' または '[ホスト]:ポート番号' の形式でなければなりません’
pa: ਪੀਅਰ ਦਾ ਐਂਡ-ਪੁਆਇੰਟ ‘host:port’ ਜਾਂ ‘[host]:port’ ਰੂਪ ਵਿੱਚ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ
pl: Adres peer'a musi być w postaci „adres:port” or „[host]:port”
ro: Punctul final al perechii trebuie să fie sub forma „gazdă:port” sau „[host]:port”
ru: IP-адрес сервера должен быть в формате ’host:port’ или ’[host]:port’
sl: Končna točka vrstnika mora biti v obliki 'gostitelj:vrata' ali '[gostitelj]:vrata'
tr: Eşin uç noktası "host:port" veya "[host]: port" biçiminde olmalıdır
zh_hans: 节点的端点的格式必须为 "host:port" 或 "[host]:port"

# alertInvalidPeerMessagePersistentKeepaliveInvalid
source: Peer’s persistent keepalive must be between 0 to 65535, or unspecified
de: Der dauerhafte Keepalive des Peers muss zwischen 0 und 65535 oder nicht spezifiziert sein
es: El keepalive persistente del peer debe estar entre 0 y 65535, o no especificado
fi: Käyttäjän pysyvän keepalivin on oltava välillä 0–65535 tai määrittelemätön
fr: Le maintien persistant du pair doit être compris entre 0 et 65535, ou non spécifié
it: Il keepalive permanente del peer deve essere compreso tra 0 e 65535, o non specificato
ja: ピアの持続的キープアライブは0から65535の範囲内の値か、または未指定でなければなりません
pa: ਪੀਅਰ ਦਾ ਅਟੱਲ keepalive 0 ਤੋਂ 65535 ਵਿਚਾਲੇ ਜਾਂ ਨਾ ਦਿੱਤਾ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ
pl: Interwał podtrzymywania połączenia musi wynosić pomiędzy 0 a 65535 lub nieokreślony
ro: Mesajul keepalive persistent al perechii trebuie să fie între 0 și 65535 sau să fie nespecificat
ru: Значение поддерживания соединения пира должно быть от 0 до 65535, или не указано
sl: Trajno ohranjanje povezave vrstnika mora biti med 0 in 65535, ali nedoločeno
tr: Eşin sürekli canlı tutulması 0 ile 65535 arasında veya belirtilmemiş olmalıdır
zh_hans: 节点的连接保活间隔必须介于 0 至 65535 之间，或不指定

# alertInvalidPeerMessagePreSharedKeyInvalid
source: Peer’s preshared key must be a 32-byte key in base64 encoding
de: Der mit dem Peer geteilte Schlüssel muss ein 32-Byte-Schlüssel in base64-Kodierung sein
es: La clave precompartida del par debe ser de 32 bytes en codificación base64
fi: Osapuolen jaettu avain on oltava 32-tavuinen avain base64 -enkoodauksella
fr: La clef pré-partagée par le pair doit être une clef de 32 octets dans l'encodage base64
it: La chiave pre-condivisa del peer deve essere una chiave a 32 byte con codifica base64
ja: ピアの事前共有鍵はBase64でエンコードされた32バイトの長さでなければなりません
pa: ਪੀਅਰ ਦੀ ਪਹਿਲਾਂ-ਸਾਂਝੀ ਕੀਤੀ ਕੁੰਜੀ base64 ਇੰਕੋਡਿੰਗ ਵਿੱਚ 32-ਬਾਈਟ ਕੁੰਜੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ
pl: Klucz publiczny peer'a musi być 32-bajtowym kluczem zakodowanym w base64
ro: Cheia predistribuită a perechii trebuie să fie o cheie de 32 de octeți în codificarea base64
ru: Общий ключ пира должен быть 32-байтным в кодировке base64
sl: Vrstnikov ključ v skupni rabi mora biti 32-bajtni ključ v zapisu Base64
tr: Eşlerin önceden paylaşılan anahtarı, base64 ile kodlanmış 32 baytlık bir anahtar olmalıdır
zh_hans: 节点的预共享密钥必须是用base64编码的32字节密钥

# alertInvalidPeerMessagePublicKeyDuplicated
source: Two or more peers cannot have the same public key
de: Zwei oder mehr Peers können nicht den gleichen öffentlichen Schlüssel haben
es: Dos o mas pares no pueden tener la misma llave pùblica
fi: Kahdella tai useammalla osapuolella ei voi olla samaa julkista avainta
fr: Deux ou plusieurs pairs ne peuvent pas avoir la même clef publique
it: Due o più peer non possono avere la stessa chiave pubblica
ja: 複数のピアで同じ公開鍵は使用できません
pa: ਦੋ ਜਾਂ ਵੱਧ ਪੀਅਰਾਂ ਦੀ ਇੱਕ ਪਬਲਿਕ ਕੁੰਜੀ ਨਹੀਂ ਹੋ ਸਕਦੀ ਹੈ
pl: Dwa lub więcej peer'ów nie może współdzielić tego samego klucza publicznego
ro: Două sau mai multe perechi nu pot avea aceeași cheie publică
ru: Два или более пиров не могут иметь один и тот же публичный ключ
sl: Dva ali več vrstnikov ne more imeti enakega javnega ključa
tr: İki veya daha fazla eş aynı ortak anahtara sahip olamaz
zh_hans: 两个或多个节点不能拥有相同的公钥
